ocake/app/Models/AddOns_model.php

    public function fetchAddOns() {
        $session= session();
        if($session->type == "admin"){
            return $this->select('*')
                        ->get()->getResult();
---
SELECT *
FROM `add_ons`

	public function count_addons(){
		return $this->db->table('add_ons')
					->select('Count(add_ons_id) as count')
                    ->get()->getResult();
---
SELECT Count(add_ons_id) as count
FROM `add_ons`