ocake/app/Models/Address_model.php

    public function fetchAddress() {
        return $this->select('*')
                    ->get()->getResult();
---
SELECT *
FROM `address`