ocake/app/Models/Cart_m.php

SELECT *
FROM `cart` as `c`
JOIN `product` as `p` ON `p`.`id`=`c`.`product_id`
WHERE `c`.`user_id` = '46'
AND `order_code` = ''
---
    public function getCartData($id) {
        return $this->db->table('cart as c')
                        ->select('*')
                        ->join('product as p','p.id=c.product_id')
                        ->where('c.user_id', $id)
                        ->where('order_code', "","OR",'is_check', "1")
                        ->get()->getResult();

UPDATE `cart` SET `order_code` = '20230521226A'
WHERE `user_id` = '20'
AND `order_code` = ''
---
    public function cart_update($code, $id,$cart_id){
        // return "hi";
        $update = $this->set('order_code', $code)
                        ->where('cart_id', $cart_id)
                        ->where('user_id', $id)
                        ->where('order_code', "")
                        ->update();

SELECT Count(cart_id) as count
FROM `cart`
WHERE `user_id` = '20'
AND `order_code` = ''
AND `is_check` = '0'
---
    public function count_datas($id){
        return $this->db->table('cart')
                    ->select('Count(cart_id) as count')
                    ->where('user_id', $id)
                    ->where('order_code', "","OR",'is_check', "0")
                    ->get()->getResult();

DELETE FROM `cart`
WHERE `cart_id` = '173'
---
    public function cart_delete($id){
        $result = $this->db->table('cart')
                          ->where('cart_id',$id)
                          ->delete();