ocake/app/Models/Category_model.php

SELECT *
FROM `category`
---
    public function fetchCategory() {
        $session= session();
        if($session->type == "admin"){
            return $this->select('*')
                        ->get()->getResult();