ocake/app/Models/Checkout_model.php

INSERT INTO `checkout` (`user_id`, `biller_id`, `total_price`, `downpayment`, `shipping_fee`, `balance`, `items`, `payment`, `order_code`, `image`) VALUES ('20', 136, '490', '245', '0', '245', '3 ', 'Downpayment', '20230521226A', '02.png')
---
    public function save_checkout($data){
        //this will save data in biller_details table
        $insert = $this->insert($data);

SELECT *
FROM `checkout` as `co`
JOIN `biller_details` as `b` ON `b`.`biller_id`=`co`.`biller_id`
JOIN `users` as `u` ON `u`.`id`=`co`.`user_id`
---
    public function getCheckoutData() {
        return $this->db->table('checkout as co')
                        ->select('*')
                        ->join('biller_details as b','b.biller_id=co.biller_id')
                        ->join('users as u','u.id=co.user_id')
                        ->get()->getResult();

SELECT *
FROM `checkout` as `co`
JOIN `users` as `u` ON `u`.`id`=`co`.`user_id`
JOIN `cart` as `c` ON `c`.`order_code`=`co`.`order_code`
JOIN `product` as `p` ON `c`.`product_id`=`p`.`id`
---
    public function getDetails() {
        return $this->db->table('checkout as co')
                        ->select('*')
                        ->join('users as u','u.id=co.user_id')
                        ->join('cart as c','c.order_code=co.order_code')
                        ->join('product as p','c.product_id=p.id')
                        ->get()->getResult();

SELECT *
FROM `checkout` as `co`
JOIN `biller_details` as `b` ON `b`.`biller_id`=`co`.`biller_id`
JOIN `users` as `u` ON `u`.`id`=`co`.`user_id`
WHERE `co`.`user_id` = '20'
AND `stat` != 'Shipped'
AND `stat` != 'Delivered'
AND `stat` != 'Completed'
AND `stat` != 'Cancelled'
GROUP BY `co`.`created_at`
---
    public function getData($id) {
        return $this->db->table('checkout as co')
                        ->select('*')
                        ->join('biller_details as b','b.biller_id=co.biller_id')
                        ->join('users as u','u.id=co.user_id')
                        ->where('co.user_id', $id)
                        ->where ('stat !=', "Shipped")
                        ->where ('stat !=', "Delivered")
                        ->where ('stat !=', "Completed")
                        ->where('stat !=', "Cancelled")
                        ->groupBy('co.created_at')
                        ->get()->getResult();

SELECT *
FROM `checkout` as `co`
JOIN `biller_details` as `b` ON `b`.`biller_id`=`co`.`biller_id`
JOIN `users` as `u` ON `u`.`id`=`co`.`user_id`
WHERE `co`.`user_id` = '46'
AND `stat` != 'Pending'
AND `stat` != 'Confirmed'
AND `stat` != 'Processing'
AND `stat` != 'Completed'
AND `stat` != 'Cancelled'
GROUP BY `co`.`created_at`
---
    public function getToReceived($id){
        return $this->db->table('checkout as co')
                        ->select('*')
                        ->join('biller_details as b','b.biller_id=co.biller_id')
                        ->join('users as u','u.id=co.user_id')
                        ->where('co.user_id', $id)
                        ->where ('stat !=', "Pending")
                        ->where('stat !=', "Confirmed")
                        ->where ('stat !=', "Processing")
                        ->where ('stat !=', "Completed")
                        ->where('stat !=', "Cancelled")
                        ->groupBy('co.created_at')
                        ->get()->getResult();

SELECT Count(checkout_id) as count
FROM `checkout`
WHERE `stat` = 'Pending'
---
	public function count_pending(){
		return $this->db->table('checkout')
					->select('Count(checkout_id) as count')
                    ->where('stat',"Pending")
					->get()->getResult();

SELECT Count(checkout_id) as count
FROM `checkout`
WHERE `stat` = 'Shipped'
---
	public function count_shipped(){
		return $this->db->table('checkout')
					->select('Count(checkout_id) as count')
                    ->where('stat',"Shipped")
					->get()->getResult();

SELECT Count(checkout_id) as count
FROM `checkout`
WHERE `stat` = 'Cancelled'
---
	public function count_cancelled(){
		return $this->db->table('checkout')
					->select('Count(checkout_id) as count')
                    ->where('stat',"Cancelled")
					->get()->getResult();

SELECT Count(checkout_id) as count
FROM `checkout`
WHERE `stat` = 'Completed'
---
	public function count_completed(){
		return $this->db->table('checkout')
					->select('Count(checkout_id) as count')
                    ->where('stat',"Completed")
					->get()->getResult();

SELECT Sum(total_price) as sum
FROM `checkout`
WHERE `stat` = 'Completed'
---
	public function count_earnings(){
		return $this->db->table('checkout')
					->select('Sum(total_price) as sum')
                    ->where('stat',"Completed")
					->get()->getResult();

SELECT Count(checkout_id) as count
FROM `checkout`
WHERE `user_id` = '46'
AND `stat` != 'Completed'
AND `stat` != 'Cancelled'
---
	public function count_orders($id){
		return $this->db->table('checkout')
					->select('Count(checkout_id) as count')
                    ->where('user_id', $id)
                    ->where ('stat !=', "Completed")
                    ->where('stat !=', "Cancelled")
					->get()->getResult();

SELECT Sum(total_price) as total
FROM `checkout`
WHERE MONTH(created_at) = '05'
AND `stat` = 'Completed'
---
    public function monthly_earnings(){
        return $this->db->table('checkout')
					->select('Sum(total_price) as total')
                    ->where('MONTH(created_at)',date('m'))
                    ->where('stat',"Completed")
					->get()->getResult();

SELECT Sum(total_price) as total
FROM `checkout`
WHERE YEAR(created_at) = '2023'
AND `stat` = 'Completed'
---
    public function yearly_earnings(){
        return $this->db->table('checkout')
					->select('Sum(total_price) as total')
                    ->where('YEAR(created_at)',date('Y'))
                    ->where('stat',"Completed")
					->get()->getResult();

SELECT Sum(total_price) as total
FROM `checkout`
WHERE `created_at` >= '2023-05-21'
AND `created_at` <= '2023-05-28'
AND `stat` = 'Completed'
---
    public function weekly_earnings(){
        $start = date('Y-m-d',strtotime('last sunday'));
        $end = date('Y-m-d',strtotime('next sunday'));
        return $this->db->table('checkout')
					->select('Sum(total_price) as total')
                    ->where('created_at >=', $start)
                    ->where('created_at <=', $end)
                    ->where('stat',"Completed")
					->get()->getResult();

SELECT Sum(total_price) as total
FROM `checkout`
WHERE `stat` = 'Completed'
---
    public function total_earnings(){
        return $this->db->table('checkout')
					->select('Sum(total_price) as total')
                    ->where('stat',"Completed")
					->get()->getResult();

SELECT *, count(product_id) as total
FROM `checkout`
LEFT JOIN `cart` as `c` ON `c`.`order_code` = `checkout`.`order_code`
LEFT JOIN `product` ON `product`.`id` = `c`.`product_id`
WHERE `stat` = 'Completed'
GROUP BY `product_id`
ORDER BY `total` DESC
 LIMIT 5
---
    public function grossingProduct(){
        return $this->db->table('checkout')
                    ->join('cart as c', 'c.order_code = checkout.order_code', 'left')
                    ->join('product', 'product.id = c.product_id', 'left')
                    ->select('*,count(product_id) as total')
                    ->where('stat',"Completed")
                    ->groupBy('product_id')
                    ->orderBy('total', 'desc')
                    ->limit(5)
					->get()->getResult();