ocake/app/Models/Flavor_model.php

SELECT *
FROM `flavor`
---
    public function fetchFlavor() {
        $session= session();
        if($session->type == "admin"){
        return $this->select('*')
                    ->get()->getResult();