ocake/app/Models/Personal_m.php

SELECT Count(id) as count
FROM `users`
---
	public function count_users(){
		return $this->db->table('users')
					->select('Count(id) as count')
					->get()->getResult();

SELECT *
FROM `users`
WHERE `id` = '20'
---
    public function profile_update($data,$id){
        $result = $this->db->table('users')
            ->where('id', $id)
            ->set ($data)
            ->update();

SELECT *
FROM `users`
WHERE `id` = '20'
---
    public function updateVerificationStatus($id) {
        $res = $this->db->table('users')
                    ->where('id', $id)
                    ->update([
                        'is_verified' => 1,
                    ]);