ocake/app/Models/Product_model.php

SELECT *
FROM `product`
WHERE `is_customized` = 0
---
  public function fetchProduct() {
    return $this->where('is_customized', 0)

SELECT *
FROM `product`
WHERE `is_customized` = 0
---
  public function getProduct() {
    $session= session();
    if($session->type == "admin"){
      return $this->where('is_customized', 0)
                  ->get()->getResult();

SELECT *
FROM `product` as `po`
JOIN `category` as `cat` ON `cat`.`category_id`=`po`.`cat_id`
WHERE `po`.`status` = 'Available'
---
  public function getProductData() {
    return $this->db->table('product as po')
                    ->select('*')
                    ->join('category as cat','cat.category_id=po.cat_id')
                    ->where('po.status', "Available")
                    ->get()->getResult();

SELECT *
FROM `product`
WHERE `occasion` = 'Birthday'
AND `status` = 'Available'
---
  public function getBDay($occasion) {
    $session= session();
    if($session->type == "admin"){
      return $this->select('*')->where('occasion', $occasion)
                  ->get()->getResult();
    }if($session->type == "user"){
      return $this->select('*')->where('occasion', $occasion)
                  ->where('status', "Available")
                  ->get()->getResult();

UPDATE `product` SET `occasion` = 'Christening', `product_name` = 'fgv', `flavor` = 'Vanilla', `status` = 'Available', `price` = '123.00', `availability` = 'Pre Order', `stock` = '150'
WHERE `id` = '157'
---
  public function prod_update($data,$id){
    $result = $this->db->table('product')
        ->where('id', $id)
        ->set ($data)
        ->update();

SELECT Count(id) as count
FROM `product`
WHERE `userid` = '0'
---
	public function count_products(){
		return $this->db->table('product')
					          ->select('Count(id) as count')
                    ->where('userid', "0")
                    ->get()->getResult();

SELECT *
FROM `product`
ORDER BY `created_at` DESC
 LIMIT 5
---
  public function getNewAddedProduct(){
    return $this->limit(5)
                ->orderBy('created_at', 'desc')
                ->get()->getResult();