ocake/app/Controllers/CartController.php

    public function index(){
        if(isset($_SESSION['logged_in']) == true && isset($_SESSION['type']) == "user"){
            $id = $_SESSION['user_id'];
            $cartModel = new Cart_m();
            $data = $cartModel->join('product as prod','prod.id=product_id')->where('user_id = '.$id.' AND '.'order_code = ""')->get()->getResult();
---
SELECT *
FROM `cart`
JOIN `product` as `prod` ON `prod`.`id`=`product_id`
WHERE `user_id` = 20 AND `order_code` = ""

    public function checkoutindex(){
        if(isset($_SESSION['logged_in']) == true && isset($_SESSION['type']) == "user"){
            $id = $_SESSION['user_id'];
            $cartModel = new Cart_m();
            $data = $cartModel->join('product as prod','prod.id=product_id')->where('user_id = '.$id.' AND '.'is_check='.'1'.' AND '.'order_code = ""')->get()->getResult();
---
SELECT *
FROM `cart`
JOIN `product` as `prod` ON `prod`.`id`=`product_id`
WHERE `user_id` = 20 AND `is_check` = 1 AND `order_code` = ""

    public function cartUpdateCheckout1()
    {
        // $cart_id = $this->request->getPost('cart_id');
        $cartModel = new Cart_m();
        $data = [
            'is_check' => $this->request->getPost('is_check'),
        ];
        $cartModel->where("cart_id >","0")->set($data)->update();
---
UPDATE `cart` SET `is_check` = '1'
WHERE `cart`.`cart_id` IN ('215')