ocake/app/Controllers/CustomersController.php

SELECT *
FROM `customers`
---
    public function getAllData(){
        $customersModel = new CustomersModel();
        $data = $customersModel->findAll();