ocake/app/Controllers/PosController.php

SELECT *
FROM `product`
---
    public function getAllProducts(){
        $productsModel = new Product_model();
        $data = $productsModel->findAll();

SELECT *
FROM `product`
WHERE `id` = 158
---
    public function selectProduct(){
        $productsModel = new Product_model();
        $data = $productsModel->select("*")->where('id = '.$this->request->getPost('p_id'))->get()->getResult();

SELECT *
FROM `invoice_cart`
JOIN `product` as `prod` ON `prod`.`id`=`product_id`
WHERE `invoice_number` = 02932
---
    public function getAllInvoice(){
        $invoicecartModel = new InvoiceCartModel();
        $data = $invoicecartModel->join('product as prod','prod.id=product_id')->where('invoice_number = '.$this->request->getVar('invoice_numbers'))->get()->getResult();

SELECT *
FROM `invoice_cart`
WHERE `invoice_number` = 092 AND `product_id` = 157
---
    public function invoiceProductAvailability(){
        $invoicecartModel = new InvoiceCartModel();
        $data = $invoicecartModel->select("*")->where('invoice_number = '.$this->request->getPost('invoicenumber').' AND '.'product_id='.$this->request->getPost('prod_id'))->get()->getResult();