ocake/app/Controllers/PosController.php

    public function getAllInvoice(){
        $invoicecartModel = new InvoiceCartModel();
        $data = $invoicecartModel->join('product as prod','prod.id=product_id')->where('invoice_number = '.$this->request->getVar('invoice_numbers'))->get()->getResult();
---
SELECT *
FROM `invoice_cart`
JOIN `product` as `prod` ON `prod`.`id`=`product_id`
WHERE `invoice_number` = 2002

    public function addToInvoice()
    {
        $invoicecartModel = new InvoiceCartModel();
        $data = [
            'invoice_number' => $this->request->getPost('invoice_number'),
            'product_id' => $this->request->getPost('product_id'),
            'quantity' => $this->request->getPost('quantity'),
            'totalAmount' => $this->request->getPost('totalAmount'),
        ];
        $invoicecartModel->save($data);
---
INSERT INTO `invoice_cart` (`invoice_number`, `product_id`, `quantity`, `totalAmount`) VALUES ('2020', '11', '1', '400.00')