ocake/app/Controllers/User.php

INSERT INTO `cart` (`user_id`, `occasion`, `flavor`, `total_price`, `price`, `quantity`, `product_id`) VALUES ('20', 'Birthday', 'Mango', '350.00', '350.00', '1', '9')
---
    public function add_cart(){
        if(isset($_SESSION['logged_in']) == true && isset($_SESSION['type']) == "user"){
            helper(['form', 'url']);
            $val = $this->validate([

            ]);

            $model = new Cart_m();
            $qty ='1';
            // var_dump($_SESSION['user_id']);
            $model->insert([
                'user_id' => $_SESSION['user_id'],
                'occasion' => $this->request->getVar('occasion'),
                'flavor' => $this->request->getVar('flavor'),
                'total_price' => $this->request->getVar('price'),
                'price' => $this->request->getVar('price'),
                'quantity' => $qty,
                'product_id' => $this->request->getVar('pid'),
            ]);