ocake/app/Controllers/User.php

    public function getAllAddOns(){
        $addonsModel = new AddOns_model();
        $data = $addonsModel->where('addons_status','Available')->get()->getResult();
---
SELECT *
FROM `add_ons`
WHERE `addons_status` = 'Available'